{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s1_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "s1_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s1_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s1_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "s1_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "s1_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "s1_global_pool", 
      "attrs": {
        "kernel": "(33, 33)", 
        "pad": "(16, 16)", 
        "pool_type": "max", 
        "stride": "(16, 16)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s2_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "s2_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s2_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s2_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "s2_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "s2_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "s2_global_pool", 
      "attrs": {
        "kernel": "(17, 17)", 
        "pad": "(8, 8)", 
        "pool_type": "max", 
        "stride": "(8, 8)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "s2_pool", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s3_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "s3_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s3_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s3_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "s3_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "s3_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "s3_global_pool", 
      "attrs": {
        "kernel": "(9, 9)", 
        "pad": "(4, 4)", 
        "pool_type": "max", 
        "stride": "(4, 4)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "s3_pool", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s4_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "s4_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s4_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s4_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s4_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s4_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "s4_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "s4_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "s4_pool", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "feature", 
      "attrs": {
        "dim": "1", 
        "num_args": "4"
      }, 
      "inputs": [[9, 0, 0], [19, 0, 0], [29, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s5_conv_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "960", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "s5_conv", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "960", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s5_bn_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s5_bn_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s5_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s5_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "s5_bn", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "s5_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "s5_global_conv_weight", 
      "attrs": {
        "kernel": "(8, 8)", 
        "num_filter": "960", 
        "num_group": "960", 
        "pad": "(0, 0)", 
        "stride": "(8, 8)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "s5_global_conv_bias", 
      "attrs": {
        "kernel": "(8, 8)", 
        "num_filter": "960", 
        "num_group": "960", 
        "pad": "(0, 0)", 
        "stride": "(8, 8)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "s5_global_conv", 
      "attrs": {
        "kernel": "(8, 8)", 
        "num_filter": "960", 
        "num_group": "960", 
        "pad": "(0, 0)", 
        "stride": "(8, 8)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "drop", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_weight", 
      "attrs": {"num_hidden": "340"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_bias", 
      "attrs": {"num_hidden": "340"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc", 
      "attrs": {"num_hidden": "340"}, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "attrs": {"grad_scale": "1"}, 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "attrs": {"grad_scale": "1"}, 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    11, 
    13, 
    14, 
    15, 
    16, 
    21, 
    23, 
    24, 
    25, 
    26, 
    31, 
    33, 
    34, 
    35, 
    36, 
    41, 
    43, 
    44, 
    45, 
    46, 
    49, 
    50, 
    53, 
    54, 
    56
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    58, 
    59, 
    60, 
    61, 
    62, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69
  ], 
  "heads": [[57, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}